Tekla.Structures.Analysis.AnalysisResultPositions
Replaced by AnalysisResult.GetResults.
The AnalysisResultPositions class contains information about analysis result positions.
The following example queries the available analysis result positions for the object.
using Tekla.Structures.Analysis;
using System.Collections;
public class Example
{
public void Example1()
{
int PartId = 0;
AnalysisResultPositions ResultPositions = new AnalysisResultPositions();
ResultPositions.ObjectType = AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_PART;
ResultPositions.ObjectId = PartId;
bool Result = ResultPositions.GetResultPositions();
ArrayList ValuePositions = ResultPositions.aPositions;
ArrayList ValuePositionsX = ResultPositions.aPositionsX;
ArrayList ValuePositionsY = ResultPositions.aPositionsY;
ArrayList ValuePositionsZ = ResultPositions.aPositionsZ;
}
}

Tekla.Structures.Analysis.AnalysisResultPositions.objectId
Id of the Object

Tekla.Structures.Analysis.AnalysisResultPositions.objectType
ObjectType, currently only supported type is physical member (part)

Tekla.Structures.Analysis.AnalysisResultPositions.positionCount
Number of returned positions

Tekla.Structures.Analysis.AnalysisResultPositions.positionTypes
Position types

Tekla.Structures.Analysis.AnalysisResultPositions.positionsX
Position X coordinates

Tekla.Structures.Analysis.AnalysisResultPositions.positionsY
Position Y coordinates

Tekla.Structures.Analysis.AnalysisResultPositions.positionsZ
Position Z coordinates

Tekla.Structures.Analysis.AnalysisResultPositions.ObjectType
The object type. In result query the only supported type is the physical member (the part).

Tekla.Structures.Analysis.AnalysisResultPositions.ObjectId
The identifier of the object.

Tekla.Structures.Analysis.AnalysisResultPositions.nPositions
The number of returned positions.

Tekla.Structures.Analysis.AnalysisResultPositions.aPositions
The position types.

Tekla.Structures.Analysis.AnalysisResultPositions.aPositionsX
The X coordinates of the positions.

Tekla.Structures.Analysis.AnalysisResultPositions.aPositionsY
The Y coordinates of the positions.

Tekla.Structures.Analysis.AnalysisResultPositions.aPositionsZ
The Z coordinates of the positions.

Tekla.Structures.Analysis.AnalysisResultPositions.#ctor
Creates a new analysis result positions instance.

Tekla.Structures.Analysis.AnalysisResultPositions.GetResultPositions
Replaced by AnalysisResult.GetResults.
Gets the analysis result positions.
Returns: True if successfully got the analysis result positions.